// Задача 1F. Покер

// Даны пять целых чисел. Среди них:
// • если одинаковы 5, то вывести «Impossible», иначе;
// • если одинаковы 4, то вывести «Four of a Kind», иначе;
// • если одинаковы 3 и 2, то вывести «Full House», иначе;
// • если есть 5 последовательных, то вывести «Straight», иначе;
// • если одинаковы 3, то вывести «Three of a Kind», иначе;
// • если одинаковы 2 и 2, то вывести «Two Pairs», иначе;
// • если одинаковы 2, то вывести One «Pair», иначе;
// • вывести «Nothing».
// Ограничения: все числа от 1 до 13 включительно, время 1 с.
// Ввод из файла poker.in. В первой строке находятся пять чисел через пробел.
// Вывод в файл poker.out. Выводится одна строка — результат анализа.